
## :white_check_mark: Apply Succeeded





<pre><code>Apply complete! Resources: 15 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_service_account.secrets_leak_detector: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.gcs_bucket_mover: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_monitoring_alert_policy.secrets_leak_log_scanner: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/15677332264241438988]
data.google_project.project: Reading...
google_service_account.github_issue_creator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com]
google_monitoring_alert_policy.gcs_bucket_mover: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/5579410898419231270]
google_monitoring_alert_policy.github_issue_creator: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/9821277804074506500]
google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/16641435238811176146]
google_storage_bucket.kyma_prow_logs_secured: Refreshing state... [id=kyma-prow-logs-secured]
google_monitoring_alert_policy.github_issue_finder: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/15999866418925089607]
data.google_storage_bucket.kyma_prow_logs: Reading...
google_service_account.github_issue_finder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
google_service_account.secrets_leak_log_scanner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.google_iam_policy.run_invoker: Reading...
data.google_iam_policy.run_invoker: Read complete after 0s [id=735823064]
data.google_storage_bucket.kyma_prow_logs: Read complete after 0s [id=kyma-prow-logs]
google_storage_bucket_iam_member.secrets_leak_detector: Refreshing state... [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin: Refreshing state... [id=b/kyma-prow-logs-secured/roles/storage.objectAdmin/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_storage_bucket_iam_member.kyma_prow_logs_viewer: Refreshing state... [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_cloud_run_service.gcs_bucket_mover: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
google_cloud_run_service.secrets_leak_log_scanner: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.scan_logs_for_secrets_yaml will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_logs_for_secrets_yaml" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            main:
              params: [ event ]
              steps:
                - check:
                    call: json.decode
                    args:
                      data: $${event.data.message.data}
                    result: step_result
                - check_if_prowjob_finished:
                    switch:
                      - condition: $${step_result.status in ["success", "failure", "aborted"]}
                        steps:
                          - search_secrets_leaks_in_logs:
                              call: http.post
                              args:
                                url: ${scan-logs-for-secrets-url}
                                auth:
                                  type: OIDC
                                headers:
                                  Content-Type: "application/cloudevents+json"
                                body: $${event}
                              result: step_result
                          - check_if_leaks_found:
                              switch:
                                - condition: $${step_result.body.type == "prowjob.logs.leaks.found"}
                                  steps:
                                    - move_gcs_bucket:
                                        call: http.post
                                        args:
                                          url: ${move-gcs-bucket-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - search_github_issues:
                                        call: http.post
                                        args:
                                          url: ${search-github-issue-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - check_if_issue_found:
                                        switch:
                                          - condition: $${step_result.body.type == "sap.tools.github.leakissue.notfound"}
                                            steps:
                                              - create_github_issue:
                                                  call: http.post
                                                  args:
                                                    url: ${create-github-issue-url}
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                              - send_slack_message:
                                                  call: http.post
                                                  args:
                                                    url: ${send-slack-message-url}/secret-leak-found
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                                  next: return_result
                                        next: return_result
                              next: return_result
                          - return_result:
                              return: $${step_result}
                    next: end
        EOT
      + vars     = {
          + "create-github-issue-url"   = (known after apply)
          + "move-gcs-bucket-url"       = "https://gcs-bucket-mover-q25ja7ch3q-ey.a.run.app"
          + "scan-logs-for-secrets-url" = "https://secrets-leak-log-scanner-q25ja7ch3q-ey.a.run.app"
          + "search-github-issue-url"   = (known after apply)
          + "send-slack-message-url"    = (known after apply)
        }
    }

  # google_cloud_run_service.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service" "gcs_bucket_mover" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover"
        name                       = "gcs-bucket-mover"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all" -> null
              - "run.googleapis.com/operation-id"   = "4c6e89b3-dcaa-4427-8da6-285f46518f82" -> null
                # (4 unchanged elements hidden)
            }
            # (6 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.github_issue_creator will be created
  + resource "google_cloud_run_service" "github_issue_creator" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-creator"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/creategithubissue:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "github-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-creator"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.github_issue_finder will be created
  + resource "google_cloud_run_service" "github_issue_finder" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-finder"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/searchgithubissue:v20230202-40569193"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-finder"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service" "secrets_leak_log_scanner" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner"
        name                       = "secrets-leak-log-scanner"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all" -> null
              - "run.googleapis.com/operation-id"   = "e02524aa-a420-4a34-af65-2a7fac61b2a3" -> null
                # (4 unchanged elements hidden)
            }
            # (6 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.slack_message_sender will be created
  + resource "google_cloud_run_service" "slack_message_sender" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "slack-message-sender"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "slack-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "slack-message-sender"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "SLACK_BASE_URL"
                      + value = "https://slack.com/api"
                    }
                  + env {
                      + name  = "SLACK_CHANNEL_ID"
                      + value = "C01KSP10MB5"
                    }
                  + env {
                      + name  = "SLACK_TOKEN_PATH"
                      + value = "/etc/slack-secret/common-slack-bot-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/slack-secret"
                      + name       = "slack-token"
                    }
                }

              + volumes {
                  + name = "slack-token"

                  + secret {
                      + secret_name = "common-slack-bot-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.gcs_bucket_mover will be created
  + resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "gcs-bucket-mover"
    }

  # google_cloud_run_service_iam_policy.github_issue_creator will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "github-issue-creator"
    }

  # google_cloud_run_service_iam_policy.github_issue_finder will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "github-issue-finder"
    }

  # google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "secrets-leak-log-scanner"
    }

  # google_cloud_run_service_iam_policy.slack_message_sender will be created
  + resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "slack-message-sender"
    }

  # google_eventarc_trigger.secrets_leak_detector_workflow will be created
  + resource "google_eventarc_trigger" "secrets_leak_detector_workflow" {
      + conditions      = (known after apply)
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)
      + labels          = {
          + "application" = "secrets_leak_detector"
        }
      + location        = "europe-west3"
      + name            = "secrets-leak-detector"
      + project         = (known after apply)
      + service_account = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + workflow = (known after apply)
        }

      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.pubsub.topic.v1.messagePublished"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = "projects/sap-kyma-prow/topics/prowjobs"
            }
        }
    }

  # google_project_iam_member.project_log_writer will be created
  + resource "google_project_iam_member" "project_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
      + project = "projects/sap-kyma-prow"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.project_workflows_invoker will be created
  + resource "google_project_iam_member" "project_workflows_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
      + project = "projects/sap-kyma-prow"
      + role    = "roles/workflows.invoker"
    }

  # google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "common-slack-bot-token"
    }

  # google_workflows_workflow.secrets_leak_detector will be created
  + resource "google_workflows_workflow" "secrets_leak_detector" {
      + create_time     = (known after apply)
      + description     = "Workflow is triggered by message published to prowjobs PubSub topic and scans prowjobs logs for secrets."
      + id              = (known after apply)
      + name            = "secrets-leak-detector"
      + name_prefix     = (known after apply)
      + project         = (known after apply)
      + region          = "europe-west3"
      + revision_id     = (known after apply)
      + service_account = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
      + source_contents = (known after apply)
      + state           = (known after apply)
      + update_time     = (known after apply)
    }

Plan: 15 to add, 2 to change, 0 to destroy.
google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor: Creating...
google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Creating...
google_project_iam_member.project_workflows_invoker: Creating...
google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Creating...
google_project_iam_member.project_log_writer: Creating...
google_cloud_run_service.secrets_leak_log_scanner: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
google_cloud_run_service.gcs_bucket_mover: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
google_cloud_run_service.secrets_leak_log_scanner: Modifications complete after 1s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
google_cloud_run_service_iam_policy.secrets_leak_log_scanner: Creating...
google_cloud_run_service.gcs_bucket_mover: Modifications complete after 1s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
google_cloud_run_service_iam_policy.gcs_bucket_mover: Creating...
google_cloud_run_service_iam_policy.secrets_leak_log_scanner: Creation complete after 0s [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner]
google_cloud_run_service_iam_policy.gcs_bucket_mover: Creation complete after 0s [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover]
google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Creation complete after 5s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_cloud_run_service.slack_message_sender: Creating...
google_project_iam_member.project_log_writer: Creation complete after 9s [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.project_workflows_invoker: Creation complete after 9s [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor: Creation complete after 10s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com]
google_cloud_run_service.github_issue_creator: Creating...
google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Creation complete after 10s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com]
google_cloud_run_service.github_issue_finder: Creating...
google_cloud_run_service.slack_message_sender: Still creating... [10s elapsed]
google_cloud_run_service.github_issue_creator: Still creating... [10s elapsed]
google_cloud_run_service.github_issue_finder: Still creating... [10s elapsed]
google_cloud_run_service.slack_message_sender: Creation complete after 16s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
google_cloud_run_service_iam_policy.slack_message_sender: Creating...
google_cloud_run_service_iam_policy.slack_message_sender: Creation complete after 1s [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/slack-message-sender]
google_cloud_run_service.github_issue_creator: Creation complete after 16s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-creator]
google_cloud_run_service_iam_policy.github_issue_creator: Creating...
google_cloud_run_service.github_issue_finder: Creation complete after 16s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder]
data.template_file.scan_logs_for_secrets_yaml: Reading...
google_cloud_run_service_iam_policy.github_issue_finder: Creating...
data.template_file.scan_logs_for_secrets_yaml: Read complete after 0s [id=c153cce6c8614a3b54b59502a5780e02a4de0c9054b593f7c96b66a658012bbc]
google_workflows_workflow.secrets_leak_detector: Creating...
google_cloud_run_service_iam_policy.github_issue_creator: Creation complete after 1s [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator]
google_cloud_run_service_iam_policy.github_issue_finder: Creation complete after 1s [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder]
google_workflows_workflow.secrets_leak_detector: Still creating... [10s elapsed]
google_workflows_workflow.secrets_leak_detector: Creation complete after 11s [id=projects/sap-kyma-prow/locations/europe-west3/workflows/secrets-leak-detector]
google_eventarc_trigger.secrets_leak_detector_workflow: Creating...
google_eventarc_trigger.secrets_leak_detector_workflow: Still creating... [10s elapsed]
google_eventarc_trigger.secrets_leak_detector_workflow: Creation complete after 13s [id=projects/sap-kyma-prow/locations/europe-west3/triggers/secrets-leak-detector]

Apply complete! Resources: 15 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","PRNumber":7013,"Program":"tfcmt","SHA1":"166cf9bb45a60f7f110b873b064baa5cc06aebc5","Vars":{}} -->